import React, {useEffect} from 'react';
import women from "../images/women.png";

const CopyrightPage = () => {
    useEffect(()=>{
        window.scrollTo(0, 0);
    }, [])
    return (
        <div className={"container "}>
            <div className={"d-flex justify-content-center"}>
                <div className={"info-card"}>
                    <h1 className={"text-center"}>Умови використання сайту "СвійEng"<br/><br/>
                        Дата набуття чинності: 08.03.2022 </h1>
                    <p>Загальні положення<br/><br/>
                        1.1. Ласково просимо на веб-сайт "СвійEng" sviyeng.com. Цей текст містить умови використання
                        Сайту. Будь ласка, прочитайте ці умови перед початком використання Сайту.<br/><br/>

                        1.2. Власником Сайту є Швець Павло Володимирович, правовласником Шевкун каріна павлівна, за
                        адресою компанії: Україна, м. Київ, вул. Василя Липківського 43.<br/><br/>

                        1.3. Використання Сайту передбачає вашу повну та беззастережну згоду з цими умовами. Якщо ви не
                        погоджуєтесь з цими умовами, не продовжуйте використовувати Сайт.<br/><br/>


                        Інтелектуальна власність<br/><br/>
                        2.1. Ніяка частина Сайту не може бути скопійована, відтворена, змінена, поширена, передана,
                        публічно відображена або використана для створення похідних творів без попередньої письменної
                        згоди Правовласника.<br/><br/>

                        Права та обов'язки користувачів<br/><br/>
                        3.1. Користувачі можуть переглядати, вибирати і придбати курси англійської мови на Сайті.<br/><br/>

                        3.2. Деякі функції Сайту можуть бути доступні лише після реєстрації користувача. Під час
                        реєстрації користувачі зобов'язані надати достовірну інформацію, таку як ПІБ, електронна пошта
                        та номер телефону.<br/><br/>

                        3.3. Користувачі зобов'язані зберігати конфіденційність своїх облікових записів та не передавати
                        їх третім особам. Вони несуть повну відповідальність за всі дії, здійснені за допомогою своїх
                        облікових записів.<br/><br/>

                        Конфіденційність даних<br/><br/>
                        4.1. Правовласник зобов'язується дотримуватися положень Закону України "Про захист персональних
                        даних" щодо збору, зберігання та обробки персональних даних користувачів.<br/><br/>

                        4.2. Правовласник може збирати та обробляти такі персональні дані користувачів: ПІБ, електронна
                        пошта та номер телефону. Ці дані використовуються виключно для забезпечення доступу до курсів
                        англійської мови та надсилання важливої інформації користувачам.<br/><br/>

                        4.3. Правовласник зобов'язується не передавати отримані персональні дані третім особам без згоди
                        відповідного користувача, за винятком випадків, передбачених законодавством.<br/><br/>

                        Зміни умів<br/><br/>
                        5.1. Правовласник залишає за собою право змінювати ці умови будь-якої години. Зміни набуватимуть
                        чинності з моменту їх опублікування на Сайті. Рекомендуємо регулярно перевіряти умови
                        використання для ознайомлення зі змінами.<br/><br/>

                        5.2. Якщо ви продовжуєте використовувати Сайт після внесення змін у ці умови, це вважається
                        вашою згодою зі зміненими умовами.<br/><br/>

                        Відповідальність<br/><br/>
                        6.1. Правовласник не несе відповідальності за будь-які прямі або непрямі збитки, втрати або
                        шкоду, що виникають внаслідок використання Сайту або нездатності використовувати його.<br/><br/>

                        6.2. Правовласник не несе відповідальності за якість, достовірність або надійність інформації,
                        наданої на Сайті третіми особами.<br/><br/>

                        Заключні положення<br/><br/>
                        7.1. Ці умови використання є єдиними домовленостями між користувачем і Правовласником щодо
                        використання Сайту і замінюють будь-які попередні угоди або домовленості.<br/><br/>

                        7.2. У разі будь-яких суперечок або спорів, які виникають у зв'язку з використанням Сайту,
                        сторони прагнуть вирішити їх шляхом дружньої узгодженості. Якщо це неможливо, спір підлягає
                        вирішенню відповідно до законодавства України.</p>
                </div>
            </div>
        </div>
    );
};

export default CopyrightPage;